package com.wei.application;

import com.alibaba.fastjson.JSONObject;

public class AboutJson {
    public static void main(String[] args) {
        String str = "{\\\"algo_version\\\":\\\"\\\",\\\"angle\\\":0,\\\"content\\\":\\\"中秋佳节 Mid-QutumnFeatial 浓情中秋 花好月圆 S2SP \\\",\\\"height\\\":1688,\\\"orgHeight\\\":1688,\\\"orgWidth\\\":3000,\\\"prism_version\\\":\\\"1.0.9\\\",\\\"prism_wnum\\\":5,\\\"prism_wordsInfo\\\":[{\\\"angle\\\":-89,\\\"direction\\\":0,\\\"height\\\":880,\\\"pos\\\":[{\\\"x\\\":1032,\\\"y\\\":257},{\\\"x\\\":1912,\\\"y\\\":257},{\\\"x\\\":1912,\\\"y\\\":485},{\\\"x\\\":1032,\\\"y\\\":485}],\\\"prob\\\":99,\\\"width\\\":226,\\\"word\\\":\\\"中秋佳节\\\",\\\"x\\\":1359,\\\"y\\\":-69},{\\\"angle\\\":-89,\\\"direction\\\":0,\\\"height\\\":634,\\\"pos\\\":[{\\\"x\\\":1170,\\\"y\\\":486},{\\\"x\\\":1803,\\\"y\\\":492},{\\\"x\\\":1802,\\\"y\\\":571},{\\\"x\\\":1169,\\\"y\\\":564}],\\\"prob\\\":96,\\\"width\\\":80,\\\"word\\\":\\\"Mid-QutumnFeatial\\\",\\\"x\\\":1446,\\\"y\\\":211},{\\\"angle\\\":-89,\\\"direction\\\":0,\\\"height\\\":486,\\\"pos\\\":[{\\\"x\\\":970,\\\"y\\\":679},{\\\"x\\\":1455,\\\"y\\\":679},{\\\"x\\\":1455,\\\"y\\\":790},{\\\"x\\\":970,\\\"y\\\":790}],\\\"prob\\\":99,\\\"width\\\":109,\\\"word\\\":\\\"浓情中秋\\\",\\\"x\\\":1158,\\\"y\\\":491},{\\\"angle\\\":-90,\\\"direction\\\":0,\\\"height\\\":496,\\\"pos\\\":[{\\\"x\\\":1481,\\\"y\\\":679},{\\\"x\\\":1978,\\\"y\\\":679},{\\\"x\\\":1978,\\\"y\\\":786},{\\\"x\\\":1481,\\\"y\\\":786}],\\\"prob\\\":99,\\\"width\\\":105,\\\"word\\\":\\\"花好月圆\\\",\\\"x\\\":1677,\\\"y\\\":484},{\\\"angle\\\":-87,\\\"direction\\\":0,\\\"height\\\":240,\\\"pos\\\":[{\\\"x\\\":1326,\\\"y\\\":941},{\\\"x\\\":1566,\\\"y\\\":952},{\\\"x\\\":1563,\\\"y\\\":1016},{\\\"x\\\":1324,\\\"y\\\":1005}],\\\"prob\\\":91,\\\"width\\\":64,\\\"word\\\":\\\"S2SP\\\",\\\"x\\\":1413,\\\"y\\\":858}],\\\"width\\\":3000}\"\n";
        JSONObject object = (JSONObject) JSONObject.parse(str);
        System.out.println(object.getJSONObject("content").get("content"));
    }
}
